//Алгоритм это набор последовательных действий , которые решают определенную задачу
//O(n) — линейная сложность - где
//О это сложность алгоритма или же его скорость;
//n - колличество операций за которое этот алгоритм приходит к финальному результату

//Линейный поиск O(n) (начинаем с первого элемента и послед-но каждый эл-ент сравниваем)

//Бинарный поиск O(log n) — логарифмическая сложность(массив отсортирован по порядку)
//log это Показатель степени, в к-рую надо возвести число, называемое основанием, чтобы получить данное число.
//

//O(n2) — квадратичная сложность

//ПРИМЕРЫ АЛГОРИТМОВ
//1)Алгоритм линейного поиска в массиве
//2)Бинарный поиск (Binary search)
//3)Сортировка выбором (Selection sort)
//4)Сортировка пузырьком (Bubble sort)
//5)Быстрая сортировка, сортировка Хоара (англ. quicksort) -САМАЯ ЭФФЕКТИВНАЯ СОРТИРОВКА O(log2n*n)
//6)Рекурсивный бинарный поиск (binary search with recursion)